###############################################################
#  Generated by:      Cadence Innovus 22.33-s094_1
#  OS:                Linux x86_64(Host ID vlsi-ria57)
#  Generated on:      Fri Feb 28 18:24:45 2025
#  Design:            top
#  Command:           saveDesign top_final
###############################################################
current_design top
create_clock [get_pins {I5/CIN}]  -name clk -period 18.000000 -waveform {0.000000 9.000000}
set_propagated_clock  [get_pins {I5/CIN}]
